#include "bsp_crc8.h"



/**********************************************************************************
  * @brief  对数据进行CRC值运算
  * @param  len--数据长度；
	          buf--数据内容
  * @retval CRC值
 *********************************************************************************/
uint8_t CRC8_Check(uint8_t len,const uint8_t *buf)
{
  uint8_t crc=0,temp=0,m=0,n=0;
	
  for(m = 0 ; m < len - 3; m ++)
  {
    temp = buf[m+3]; 
    for(n = 0 ; n < 8; n ++)
    {     
      if(((crc^temp)&0x01) == 0 )
      {
        crc >>=1;
      }
      else
      {
        crc^= 0x18;
        crc >>=1;
        crc |=0x80;
      }
      temp >>=1;
    }
  }
  return crc ;
}





/*******************************END*********************************/
